ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/DMASS0_INTAGGR_0_INTAGGR_GCNTRTI.xml
<module name="DMASS0_INTAGGR_0_INTAGGR_GCNTRTI" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="INTAGGR_GCNTRTI_count" acronym="INTAGGR_GCNTRTI_count" offset="0x0" width="64" description="The ETL Count register is read by software to determine how many times the event message has been received. This register can be written to decrement the count by a specified amount to acknowledge that a count has been processed by the host.">
		<bitfield id="CCNT" width="32" begin="31" end="0" resetval="0x0" description="Current count.  This field is incremented by the event count for each message received with this event on the Counted ETL Interface.  On write, this field will be decremented by the value written. Writing a value greater than the current count is illegal." range="31 - 0" rwaccess="R/WTD"/>
	</register>
</module>